experiment/raw/blue-green_run5_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 27.579ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 14.560ms, rate sampling interval: 33ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.24ms    2.21ms  29.34ms   98.30%
    Req/Sec     1.02      7.16    62.00     97.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.87ms
 75.000%    3.76ms
 90.000%    4.54ms
 99.000%    5.69ms
 99.900%   29.36ms
 99.990%   29.36ms
 99.999%   29.36ms
100.000%   29.36ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.501     0.000000            1         1.00
       1.958     0.100000           18         1.11
       2.197     0.200000           36         1.25
       2.433     0.300000           53         1.43
       2.639     0.400000           72         1.67
       2.865     0.500000           88         2.00
       3.031     0.550000           97         2.22
       3.179     0.600000          106         2.50
       3.379     0.650000          115         2.86
       3.635     0.700000          124         3.33
       3.759     0.750000          132         4.00
       3.847     0.775000          137         4.44
       4.023     0.800000          141         5.00
       4.215     0.825000          146         5.71
       4.267     0.850000          150         6.67
       4.471     0.875000          154         8.00
       4.503     0.887500          157         8.89
       4.607     0.900000          159        10.00
       4.871     0.912500          161        11.43
       4.963     0.925000          163        13.33
       4.983     0.937500          165        16.00
       5.019     0.943750          167        17.78
       5.031     0.950000          168        20.00
       5.051     0.956250          170        22.86
       5.051     0.962500          170        26.67
       5.211     0.968750          171        32.00
       5.251     0.971875          172        35.56
       5.251     0.975000          172        40.00
       5.371     0.978125          173        45.71
       5.371     0.981250          173        53.33
       5.691     0.984375          174        64.00
       5.691     0.985938          174        71.11
       5.691     0.987500          174        80.00
       6.071     0.989062          175        91.43
       6.071     0.990625          175       106.67
       6.071     0.992188          175       128.00
       6.071     0.992969          175       142.22
       6.071     0.993750          175       160.00
      29.359     0.994531          176       182.86
      29.359     1.000000          176          inf
#[Mean    =        3.242, StdDeviation   =        2.210]
#[Max     =       29.344, Total count    =          176]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  228 requests in 2.42m, 52.77KB read
Requests/sec:      1.57
Transfer/sec:     372.32B