experiment/raw/blue-green_run7_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 4.228ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.364ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.91ms   12.02ms  77.76ms   96.51%
    Req/Sec     0.81     11.11   222.00     99.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.53ms
 75.000%    4.54ms
 90.000%    6.00ms
 99.000%   72.64ms
 99.900%   77.82ms
 99.990%   77.82ms
 99.999%   77.82ms
100.000%   77.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.204     0.000000            1         1.00
       1.961     0.100000           18         1.11
       2.427     0.200000           36         1.25
       2.851     0.300000           52         1.43
       3.253     0.400000           69         1.67
       3.529     0.500000           86         2.00
       3.753     0.550000           95         2.22
       3.911     0.600000          104         2.50
       4.211     0.650000          114         2.86
       4.391     0.700000          121         3.33
       4.539     0.750000          129         4.00
       4.639     0.775000          135         4.44
       4.847     0.800000          139         5.00
       5.059     0.825000          142         5.71
       5.375     0.850000          147         6.67
       5.811     0.875000          151         8.00
       5.879     0.887500          153         8.89
       6.003     0.900000          155        10.00
       6.323     0.912500          157        11.43
       7.403     0.925000          160        13.33
       7.499     0.937500          162        16.00
       8.479     0.943750          163        17.78
       8.647     0.950000          164        20.00
       8.903     0.956250          165        22.86
       9.503     0.962500          166        26.67
      34.559     0.968750          167        32.00
      71.615     0.971875          168        35.56
      71.615     0.975000          168        40.00
      71.807     0.978125          169        45.71
      71.807     0.981250          169        53.33
      72.639     0.984375          170        64.00
      72.639     0.985938          170        71.11
      72.639     0.987500          170        80.00
      73.535     0.989062          171        91.43
      73.535     0.990625          171       106.67
      73.535     0.992188          171       128.00
      73.535     0.992969          171       142.22
      73.535     0.993750          171       160.00
      77.823     0.994531          172       182.86
      77.823     1.000000          172          inf
#[Mean    =        5.908, StdDeviation   =       12.023]
#[Max     =       77.760, Total count    =          172]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  224 requests in 2.00m, 51.84KB read
Requests/sec:      1.87
Transfer/sec:     442.33B