experiment/raw/blue-green_run8_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 3.506ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.897ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.37ms    2.43ms  32.69ms   95.31%
    Req/Sec     0.90     11.44   222.00     99.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.94ms
 75.000%    3.60ms
 90.000%    4.37ms
 99.000%    7.98ms
 99.900%   32.70ms
 99.990%   32.70ms
 99.999%   32.70ms
100.000%   32.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.528     0.000000            1         1.00
       2.135     0.100000           20         1.11
       2.401     0.200000           39         1.25
       2.603     0.300000           58         1.43
       2.785     0.400000           77         1.67
       2.937     0.500000           96         2.00
       3.075     0.550000          106         2.22
       3.231     0.600000          116         2.50
       3.399     0.650000          125         2.86
       3.517     0.700000          135         3.33
       3.601     0.750000          144         4.00
       3.669     0.775000          149         4.44
       3.757     0.800000          154         5.00
       3.805     0.825000          159         5.71
       3.883     0.850000          164         6.67
       4.115     0.875000          168         8.00
       4.263     0.887500          171         8.89
       4.371     0.900000          173        10.00
       4.435     0.912500          176        11.43
       5.039     0.925000          178        13.33
       5.411     0.937500          180        16.00
       5.459     0.943750          182        17.78
       5.487     0.950000          183        20.00
       6.063     0.956250          184        22.86
       6.531     0.962500          185        26.67
       6.579     0.968750          186        32.00
       7.163     0.971875          187        35.56
       7.239     0.975000          188        40.00
       7.239     0.978125          188        45.71
       7.291     0.981250          189        53.33
       7.291     0.984375          189        64.00
       7.983     0.985938          190        71.11
       7.983     0.987500          190        80.00
       7.983     0.989062          190        91.43
      10.231     0.990625          191       106.67
      10.231     0.992188          191       128.00
      10.231     0.992969          191       142.22
      10.231     0.993750          191       160.00
      10.231     0.994531          191       182.86
      32.703     0.995313          192       213.33
      32.703     1.000000          192          inf
#[Mean    =        3.370, StdDeviation   =        2.434]
#[Max     =       32.688, Total count    =          192]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  244 requests in 2.00m, 56.47KB read
Requests/sec:      2.03
Transfer/sec:     481.69B