experiment/raw/blue-green_run9_wrk_stdout.txt
Running 2m test @ http://192.168.49.2:30080/health
  2 threads and 4 connections
  Thread calibration: mean lat.: 3.437ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.900ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.25ms   51.44ms 346.88ms   97.67%
    Req/Sec     0.81     11.23   222.00     99.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.82ms
 75.000%    3.78ms
 90.000%    5.17ms
 99.000%  342.02ms
 99.900%  347.14ms
 99.990%  347.14ms
 99.999%  347.14ms
100.000%  347.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.147     0.000000            1         1.00
       1.726     0.100000           18         1.11
       2.023     0.200000           35         1.25
       2.205     0.300000           52         1.43
       2.493     0.400000           69         1.67
       2.815     0.500000           86         2.00
       3.073     0.550000           95         2.22
       3.203     0.600000          104         2.50
       3.405     0.650000          112         2.86
       3.615     0.700000          121         3.33
       3.781     0.750000          129         4.00
       4.027     0.775000          134         4.44
       4.247     0.800000          138         5.00
       4.471     0.825000          142         5.71
       4.683     0.850000          147         6.67
       5.035     0.875000          151         8.00
       5.075     0.887500          153         8.89
       5.171     0.900000          155        10.00
       5.387     0.912500          157        11.43
       5.631     0.925000          160        13.33
       5.851     0.937500          162        16.00
       6.323     0.943750          163        17.78
       6.619     0.950000          164        20.00
      13.223     0.956250          165        22.86
      13.959     0.962500          166        26.67
      19.007     0.968750          167        32.00
      19.615     0.971875          168        35.56
      19.615     0.975000          168        40.00
     342.015     0.978125          170        45.71
     342.015     0.981250          170        53.33
     342.015     0.984375          170        64.00
     342.015     0.985938          170        71.11
     342.015     0.987500          170        80.00
     346.367     0.989062          171        91.43
     346.367     0.990625          171       106.67
     346.367     0.992188          171       128.00
     346.367     0.992969          171       142.22
     346.367     0.993750          171       160.00
     347.135     0.994531          172       182.86
     347.135     1.000000          172          inf
#[Mean    =       11.249, StdDeviation   =       51.440]
#[Max     =      346.880, Total count    =          172]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  224 requests in 2.00m, 51.84KB read
Requests/sec:      1.87
Transfer/sec:     442.29B